**** 1e-10
#+begin_src R
  lowtol <- snvec(-1e5, 1, 0, tolerance = 1e-10)
  write_rds(lowtol, "out/2023-04-04_lowtol.rds")
#+end_src

#+RESULTS:
: This is snvec.r VERSION: 3.7.5 2023-03-29
: Richard E. Zeebe
: Ilja J. Kocken
: Integration parameters:
:  tend = -1e+05 kyr
:  tres = 0.4 kyr
:  Ed = 1
:  Td = 0
: Final values s[1][2][3]; s-error = |s|-1:
: -0.164426067894575 0.406888350901304 0.898597654927192
: 3.59030270373761e-05
: Final values obliquity, precession (rad):
: 0.3899853310553 1.88486960858406

**** 1e-12
#+begin_src R
  superlowtol <- snvec(-1e5, 1, 0, tolerance = 1e-12)
  write_rds(superlowtol, "out/2023-04-04_superlowtol_1e-12.rds")
#+end_src

#+RESULTS:
: This is snvec.r VERSION: 3.7.5 2023-03-29
: Richard E. Zeebe
: Ilja J. Kocken
: Integration parameters:
: tend = -1e+05 kyr
: tres = 0.4 kyr
: Ed = 1
: Td = 0
:     user   system  elapsed
: 3246.787    0.342 3255.612
: Final values s[1][2][3]; s-error = |s|-1:
: -0.143109361596917 0.419908122882867 0.896212779992251
: 2.34030537171748e-07
: Final values obliquity, precession (rad):
: 0.390596711702826 1.8189284314666

**** 1e-07
#+begin_src R
  normtol <- snvec(-1e5, 1, 0, tolerance = 1e-7)
  write_rds(normtol, "out/2023-04-04_normtol_1e-7.rds")
#+end_src

#+RESULTS:
#+begin_example
Integration parameters:
 tend = -1e+05 kyr
 Ed = 1
 Td = 0
 orbital_solution = ZB18a
 tres = 0.4 kyr
 tolerance = 1e-07
starting at Wed Apr  5 09:55:48 2023
   user  system elapsed
 24.575   0.010  24.699
Final values s[1][2][3]; s-error = |s|-1:
-0.181186234717299 0.377666080230894 0.902100420308931
-0.00539189218589675
Final values obliquity, precession (rad):
0.389933827834007 1.96689170415452
stopped at Wed Apr  5 09:56:46 2023
#+end_example
**** 1e-03
#+begin_src R
  hightol <- snvec(-1e5, 1, 0, tolerance = 1e-3)
  write_rds(hightol, "out/2023-04-05_hightol_1e-3.rds")
#+end_src

#+RESULTS:
#+begin_example
Integration parameters:
 tend = -1e+05 kyr
 Ed = 1
 Td = 0
 orbital_solution = ZB18a
 tres = 0.4 kyr
 tolerance = 0.001
started at 2023-04-05 10:12:39
   user  system elapsed
 22.583   0.000  22.659
Final values s[1][2][3]; s-error = |s|-1:
-0.1069277059072 0.423122991463078 0.893789976171586
-0.00535075443649757
Final values obliquity, precession (rad):
0.392041645216932 1.72794012401827
stopped at Wed Apr  5 10:13:33 2023
total duration 54.119035243988
#+end_example

** DONE make a function out of snvec so it's easy to vary Td and Ed
CLOSED: [2023-04-04 Tue 18:10]
:PROPERTIES:
:CREATED:  [2023-04-04 Tue 09:28]
:END:
#+begin_src R
  ## devtools::load_all()
  test <- snvec(-1e3, 1, 0)
#+end_src

#+RESULTS:
#+begin_example
Integration parameters:
 tend = -1000 kyr
 Ed = 1
 Td = 0
 orbital_solution = ZB18a
 tres = 0.4 kyr
 tolerance = 1e-07
starting at Tue Apr  4 23:06:34 2023
   user  system elapsed
  0.211   0.000   0.213
Final values s[1][2][3]; s-error = |s|-1:
0.404197400723194 -0.0537088738295803 0.91303387030935
-5.44863786333671e-05
Final values obliquity, precession (rad):
0.413056573207875 -0.562236553023642
stopped at Tue Apr  4 23:06:35 2023
#+end_example

rldpeace

